---
kind: method
id: M:Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.Dispose
source: html/8113c56f-c5c4-b995-9459-f95b16e133ec.htm
---
# Autodesk.Revit.DB.Architecture.NonContinuousRailInfo.Dispose Method

Releases all resources used by the NonContinuousRailInfo

## Syntax (C#)
```csharp
public void Dispose()
```